src_doc/Enums/ТипыЗаданий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыЗаданий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВыполнениеЗадачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДобавитьТегиHtmlПередОзнакомлениемБыстрый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДобавитьТегиHtmlПередОзнакомлениемДолгий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДобавитьТегиHtmlПриНачалеСогласованияБыстрый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДобавитьТегиHtmlПриНачалеСогласованияДолгий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДобавитьУдалитьЗаполняемыйПредмет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершениеОзнакомленияСогласования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершениеОзнакомленияСогласованияСервер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапускОбработкиПоЗадачеЭлемента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапускОбработкиПоОбработке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаршрутизацияКомплексногоПроцессаПослеВыполненияВложенного</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаршрутизацияКомплексногоПроцессаПослеВыполненияЗадачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаршрутизацияКомплексногоПроцессаПоСхемеПослеПродолжения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачатьВыполнениеДействияИсполненияПроцессами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачатьВыполнениеДействияМассовогоОзнакомления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачатьВыполнениеДействияПроцессамиНовыеУчастники</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачатьВыполнениеДействияПроцессом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачатьВыполнениеДействияСогласованияПроцессом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачатьВыполнениеДействияСогласованияПроцессомНовыеУчастники</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбновитьHtmlПередОзнакомлением</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбновитьHtmlПередОзнакомлениемСервер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбновитьДанныеЗадачПоЗамещению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбновитьДанныеЗадачПоЗамещению_ВсеИсполнителиДействийЗадач</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбновитьДанныеЗадачПоЗамещению_ИсполнителиРолейИДелегаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбновитьДанныеЗадачПоЗамещению_РабочиеГруппы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбновитьДанныеЗадачПоЗамещению_РеестрКоличествоЗадачПоИсполнителям</Name>
					<Comment>2 регистра - РеестрЗадачПоИсполнителям и КоличествоЗадачПоИсполнителям</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбновитьДанныеЗадачПоЗамещению_РассчитатьПрава</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбновитьДанныеЗадачПоЗамещению_УчастникиПроцессов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбновитьДействиеОбработки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбновитьДействиеОзнакомленияЦеликомЕслиНужно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбновитьЗадачуПоСостояниюДействия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбновитьЗадачуПриПеренаправлении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбновитьЗадачуУчастникаМассовогоОзнакомления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбновитьОбработкуОбъекта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбновитьПроцессБезДействия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработатьИзменениеКонтейнеровДля2ФА</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОстановитьОбработку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОстановитьПроцесс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменитьВыполнениеЗадачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменитьПринятиеКИсполнениюЗадачуПроцесса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПерейтиКВыполнениюДействияВнеОчереди</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеренаправлениеЗадачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереносСрокаВыполненияЗадачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодготовитьПредметКСогласованиюВРежимеЗамечаний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодготовкаОзнакомленияСогласования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрерватьПроцесс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятьКИсполнениюЗадачуПроцесса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродолжитьВыполнениеОбработкиПослеЗавершенияОзнакомленияСОжиданием</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродолжитьОбработку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродолжитьПроцесс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоздатьHtmlПриНачалеСогласования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоздатьHtmlПриНачалеСогласованияСервер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СохранитьРезультатВыполненияВЗадачуПроцесса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтартоватьПроцесс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СформироватьДанныеДляПредпросмотраФайла</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СформироватьПроцессДляИсполнителейДействияИсполнения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СформироватьПроцессДляОбработкиОбъекта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СформироватьПроцессДляПунктаДействияИсполнения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СформироватьПроцессДляРассматривающегоДействияИсполнения</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src_doc/Enums/ТипыЗаданий/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает описание типа
// 
// Параметры:
//  Тип - ПеречислениеСсылка.ТипыЗаданий - 
// 
// Возвращаемое значение:
//  Структура:
//	* Сеанс - Строка - Обозначение "Сервер", "Клиент".
//	* ТипОчереди - Строка - Обозначение типов очереди. Чтобы одни типы заданий не мешали другим.
Функция ОписаниеТипаЗадания(Тип) Экспорт
	
	ОписаниеТипа = Новый Структура ("Сеанс, ТипОчереди", "", "");
	
	ТипЗаданий = Перечисления.ТипыЗаданий;
	
	Если Тип = ТипЗаданий.СтартоватьПроцесс Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ТипОчереди = Быстрые();
	ИначеЕсли Тип = ТипЗаданий.НачатьВыполнениеДействияПроцессом Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ТипОчереди = Быстрые();
	ИначеЕсли Тип = ТипЗаданий.НачатьВыполнениеДействияСогласованияПроцессом Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ТипОчереди = Быстрые();
	ИначеЕсли Тип = ТипЗаданий.НачатьВыполнениеДействияИсполненияПроцессами Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ТипОчереди = Быстрые();
	ИначеЕсли Тип = ТипЗаданий.НачатьВыполнениеДействияПроцессамиНовыеУчастники Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ТипОчереди = Быстрые();
	ИначеЕсли Тип = ТипЗаданий.НачатьВыполнениеДействияСогласованияПроцессомНовыеУчастники Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ТипОчереди = Быстрые();
	ИначеЕсли Тип = ТипЗаданий.СформироватьПроцессДляРассматривающегоДействияИсполнения Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ТипОчереди = Быстрые();
	ИначеЕсли Тип = ТипЗаданий.СформироватьПроцессДляПунктаДействияИсполнения Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ТипОчереди = Быстрые();
	ИначеЕсли Тип = ТипЗаданий.СформироватьПроцессДляИсполнителейДействияИсполнения Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ТипОчереди = Быстрые();
	ИначеЕсли Тип = ТипЗаданий.ПодготовитьПредметКСогласованиюВРежимеЗамечаний Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ТипОчереди = Быстрые();
	ИначеЕсли Тип = ТипЗаданий.СоздатьHtmlПриНачалеСогласования Тогда
		ОписаниеТипа.Сеанс = "Клиент";
		ОписаниеТипа.ТипОчереди = Быстрые();
	ИначеЕсли Тип = ТипЗаданий.СоздатьHtmlПриНачалеСогласованияСервер Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ТипОчереди = Быстрые();
	ИначеЕсли Тип = ТипЗаданий.ДобавитьТегиHtmlПриНачалеСогласованияБыстрый Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ТипОчереди = Быстрые();
	ИначеЕсли Тип = ТипЗаданий.ДобавитьТегиHtmlПриНачалеСогласованияДолгий Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ТипОчереди = Долгие();
	ИначеЕсли Тип = ТипЗаданий.ПодготовкаОзнакомленияСогласования Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ТипОчереди = Быстрые();
	ИначеЕсли Тип = ТипЗаданий.ОбновитьHtmlПередОзнакомлением Тогда
		ОписаниеТипа.Сеанс = "Клиент";
		ОписаниеТипа.ТипОчереди = Быстрые();
	ИначеЕсли Тип = ТипЗаданий.ОбновитьHtmlПередОзнакомлениемСервер Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ТипОчереди = Быстрые();
	ИначеЕсли Тип = ТипЗаданий.ДобавитьТегиHtmlПередОзнакомлениемБыстрый Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ТипОчереди = Быстрые();
	ИначеЕсли Тип = ТипЗаданий.ДобавитьТегиHtmlПередОзнакомлениемДолгий Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ТипОчереди = Долгие();
	ИначеЕсли Тип = ТипЗаданий.ЗавершениеОзнакомленияСогласования Тогда
		ОписаниеТипа.Сеанс = "Клиент";
		ОписаниеТипа.ТипОчереди = Быстрые();
	ИначеЕсли Тип = ТипЗаданий.ЗавершениеОзнакомленияСогласованияСервер Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ТипОчереди = Быстрые();
	ИначеЕсли Тип = ТипЗаданий.ВыполнениеЗадачи Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ТипОчереди = Быстрые();
	ИначеЕсли Тип = ТипЗаданий.МаршрутизацияКомплексногоПроцессаПослеВыполненияВложенного Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ТипОчереди = Быстрые();
	ИначеЕсли Тип = ТипЗаданий.МаршрутизацияКомплексногоПроцессаПоСхемеПослеПродолжения Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ТипОчереди = Быстрые();
	ИначеЕсли Тип = ТипЗаданий.МаршрутизацияКомплексногоПроцессаПослеВыполненияЗадачи Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ТипОчереди = Быстрые();
	ИначеЕсли Тип = ТипЗаданий.СформироватьПроцессДляОбработкиОбъекта Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ТипОчереди = Быстрые();
	ИначеЕсли Тип = ТипЗаданий.СформироватьДанныеДляПредпросмотраФайла Тогда			
		ОписаниеТипа.Сеанс = "Клиент";
		ОписаниеТипа.ТипОчереди = Быстрые();
	ИначеЕсли Тип = ТипЗаданий.ЗапускОбработкиПоЗадачеЭлемента Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ТипОчереди = Быстрые();
	ИначеЕсли Тип = ТипЗаданий.ЗапускОбработкиПоОбработке Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ТипОчереди = Быстрые();
	ИначеЕсли Тип = ТипЗаданий.ОбновитьДействиеОбработки Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ТипОчереди = Быстрые();
	ИначеЕсли Тип = ТипЗаданий.ОбновитьОбработкуОбъекта Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ТипОчереди = Быстрые();
	ИначеЕсли Тип = ТипЗаданий.ПереносСрокаВыполненияЗадачи Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ТипОчереди = Быстрые();
	ИначеЕсли Тип = ТипЗаданий.ПеренаправлениеЗадачи Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ТипОчереди = Быстрые();
	ИначеЕсли Тип = ТипЗаданий.ОбновитьЗадачуПоСостояниюДействия Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ТипОчереди = Быстрые();
	ИначеЕсли Тип = ТипЗаданий.ОбновитьЗадачуПриПеренаправлении Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ТипОчереди = Быстрые();
	ИначеЕсли Тип = ТипЗаданий.СохранитьРезультатВыполненияВЗадачуПроцесса Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ТипОчереди = Быстрые();
	ИначеЕсли Тип = ТипЗаданий.ПринятьКИсполнениюЗадачуПроцесса Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ТипОчереди = Быстрые();
	ИначеЕсли Тип = ТипЗаданий.ОтменитьПринятиеКИсполнениюЗадачуПроцесса Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ТипОчереди = Быстрые(); 
	ИначеЕсли Тип = ТипЗаданий.НачатьВыполнениеДействияМассовогоОзнакомления Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ТипОчереди = Долгие();
	ИначеЕсли Тип = ТипЗаданий.ОбновитьЗадачуУчастникаМассовогоОзнакомления Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		// В сумме все эти задания - выполняются долго, но каждое в отдельности - быстрое, т.к. дробим на порции:
		ОписаниеТипа.ТипОчереди = БыстрыеМассовые();
	ИначеЕсли Тип = ТипЗаданий.ОбработатьИзменениеКонтейнеровДля2ФА Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ТипОчереди = Быстрые();
	ИначеЕсли Тип = ТипЗаданий.ПродолжитьВыполнениеОбработкиПослеЗавершенияОзнакомленияСОжиданием Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ТипОчереди = Быстрые();
	ИначеЕсли Тип = ТипЗаданий.ОбновитьПроцессБезДействия Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ТипОчереди = Быстрые();
	ИначеЕсли Тип = ТипЗаданий.ДобавитьУдалитьЗаполняемыйПредмет Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ТипОчереди = Быстрые();
	ИначеЕсли Тип = ТипЗаданий.ПрерватьПроцесс Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ТипОчереди = Быстрые();
	ИначеЕсли Тип = ТипЗаданий.ОстановитьПроцесс Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ТипОчереди = Быстрые();
	ИначеЕсли Тип = ТипЗаданий.ПродолжитьПроцесс Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ТипОчереди = Быстрые();
	ИначеЕсли Тип = ТипЗаданий.ОтменитьВыполнениеЗадачи Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ТипОчереди = Быстрые();
	ИначеЕсли Тип = ТипЗаданий.ОстановитьОбработку Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ТипОчереди = Быстрые();
	ИначеЕсли Тип = ТипЗаданий.ПродолжитьОбработку Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ТипОчереди = Быстрые();
	ИначеЕсли Тип = ТипЗаданий.ПерейтиКВыполнениюДействияВнеОчереди Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ТипОчереди = Быстрые();
	ИначеЕсли Тип = ТипЗаданий.ОбновитьДанныеЗадачПоЗамещению_ИсполнителиРолейИДелегаты
		Или Тип = ТипЗаданий.ОбновитьДанныеЗадачПоЗамещению_ВсеИсполнителиДействийЗадач
		Или Тип = ТипЗаданий.ОбновитьДанныеЗадачПоЗамещению_РеестрКоличествоЗадачПоИсполнителям
		Или Тип = ТипЗаданий.ОбновитьДанныеЗадачПоЗамещению_УчастникиПроцессов
		Или Тип = ТипЗаданий.ОбновитьДанныеЗадачПоЗамещению_РабочиеГруппы Тогда
		// В сумме все эти задания - выполняются долго, но каждое в отдельности - быстрое, т.к. дробим на порции:
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ТипОчереди = БыстрыеМассовые();
	ИначеЕсли Тип = ТипЗаданий.ОбновитьДанныеЗадачПоЗамещению
		Или Тип = ТипЗаданий.ОбновитьДанныеЗадачПоЗамещению_РассчитатьПрава Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ТипОчереди = ДолгиеМассовые();
	ИначеЕсли Тип = ТипЗаданий.ОбновитьДействиеОзнакомленияЦеликомЕслиНужно Тогда
		ОписаниеТипа.Сеанс = "Сервер";
		ОписаниеТипа.ТипОчереди = Быстрые();
	Иначе
		ВызватьИсключение НСтр("ru = 'Неизвестный тип задания.'");
	КонецЕсли;
	
	Возврат ОписаниеТипа;
	
КонецФункции

// Вернет типы для обработки на сервере
// 
// Возвращаемое значение:
// 	Массив из ПеречислениеСсылка.ТипыЗаданий
Функция ТипыОбрабатываемыеНаСервере() Экспорт
	
	Возврат ТипыПоСеансуИТипуОчереди("Сервер", "");
	
КонецФункции

// Вернет типы для обработки на сервере - долгие
// 
// Возвращаемое значение:
// 	Массив из ПеречислениеСсылка.ТипыЗаданий
Функция ТипыОбрабатываемыеНаСервереДолгие() Экспорт
	
	Возврат ТипыПоСеансуИТипуОчереди("Сервер", Долгие());
	
КонецФункции

// Вернет типы для обработки на сервере - быстрые
// 
// Возвращаемое значение:
// 	Массив из ПеречислениеСсылка.ТипыЗаданий
Функция ТипыОбрабатываемыеНаСервереБыстрые() Экспорт
	
	Возврат ТипыПоСеансуИТипуОчереди("Сервер", Быстрые());
	
КонецФункции

// Вернет типы для обработки на клиенте
// 
// Возвращаемое значение:
// 	Массив из ПеречислениеСсылка.ТипыЗаданий
Функция ТипыОбрабатываемыеНаКлиенте() Экспорт
	
	Возврат ТипыПоСеансуИТипуОчереди("Клиент", "");
	
КонецФункции

// Вернет типы для обработки на сервере - в один поток
// 
// Возвращаемое значение:
// 	Массив из ПеречислениеСсылка.ТипыЗаданий
Функция ТипыОбрабатываемыеНаСервереВОдинПоток() Экспорт
	
	ТипыВозврата = Новый Массив;
	
	ТипыВозврата.Добавить(ОбновитьHtmlПередОзнакомлениемСервер);
	ТипыВозврата.Добавить(ЗавершениеОзнакомленияСогласованияСервер);
	
	Возврат ТипыВозврата;
	
КонецФункции

// Типы заданий по сеансу и типу очереди.
// 
// Параметры:
//  Сеанс - Строка - "Клиент" или "Сервер". Если не задан, то и те, и те.
//  ТипОчереди - Строка - См. секцию ИдентификаторыТиповОчереди. Если пустая, то все типы очередей.
// 
// Возвращаемое значение:
//  Массив Из ПеречислениеСсылка.ТипыЗаданий
Функция ТипыПоСеансуИТипуОчереди(Сеанс = "", ТипОчереди = "") Экспорт
	
	ТипыВозврата = Новый Массив();
	Для Каждого Значение Из Перечисления.ТипыЗаданий Цикл
		Описание = ОписаниеТипаЗадания(Значение);
		
		Если ЗначениеЗаполнено(Сеанс) И Описание.Сеанс <> Сеанс Тогда
			Продолжить; // не тот сеанс.
		КонецЕсли;
		Если ЗначениеЗаполнено(ТипОчереди) И Описание.ТипОчереди <> ТипОчереди Тогда
			Продолжить; // не тот тип очереди.
		КонецЕсли;
		
		ТипыВозврата.Добавить(Значение);
	КонецЦикла;
	
	Возврат ТипыВозврата;
	
КонецФункции

#Область ТипыОчереди

// Идентификатор "Быстрые".
// 
// Возвращаемое значение:
//  Строка
Функция Быстрые() Экспорт
	
	Возврат "Быстрые";
	
КонецФункции

// Идентификатор "Долгие".
// 
// Возвращаемое значение:
//  Строка
Функция Долгие() Экспорт
	
	Возврат "Долгие";
	
КонецФункции

// Идентификатор "БыстрыеМассовые". Такие задания бывают редко, но их единовременно ставится много и они надолго
// занимают очередь.
// Им - отдельная очередь - они ждут друг друга только между собой.
// 
// Возвращаемое значение:
//  Строка
Функция БыстрыеМассовые() Экспорт
	
	Возврат "БыстрыеМассовые";
	
КонецФункции

// Идентификатор "ДолгиеМассовые". Такие задания бывают редко, но они выполняются долго и занимают очередь.
// Им - отдельная очередь - они ждут друг друга только между собой.
// 
// Возвращаемое значение:
//  Строка
Функция ДолгиеМассовые() Экспорт
	
	Возврат "ДолгиеМассовые";
	
КонецФункции

// Синоним типа очереди для показа на формах.
// 
// Параметры:
//  Очередь - Строка
// 
// Возвращаемое значение:
//  Строка
Функция СинонимТипаОчереди(Очередь) Экспорт
	
	Если Очередь = Быстрые() Тогда
		Возврат НСтр("ru = 'Быстрые'");
	ИначеЕсли Очередь = Долгие() Тогда
		Возврат НСтр("ru = 'Долгие'");
	ИначеЕсли Очередь = БыстрыеМассовые() Тогда
		Возврат НСтр("ru = 'Быстрые массовые'");
	ИначеЕсли Истина Тогда
		Возврат НСтр("ru = 'Долгие массовые'");
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

#КонецОбласти // ИдентификаторыТиповОчереди

#КонецОбласти

#КонецЕсли
